# ProfileCount Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Form..::..ProfileCount Property
Form Class See Also
---
The number of profiles in the form.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int ProfileCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProfileCount As Integer
	Get
```

Visual C++
---
```text
public:
property int ProfileCount {
	int get ();
}
```

# See Also
Form Class
Autodesk.Revit.DB Namespace